var tc141201 = [
{'id': 'B0FFLFL11U', 'name': '复旦大学', 'location': '121.503971,31.296860', 'lng': 121.503971, 'lat': 31.29686},
{'id': 'B00154DQPM', 'name': '复旦大学张江校区', 'location': '121.597919,31.190369', 'lng': 121.597919, 'lat': 31.190369},
{'id': 'B0FFFYF00D', 'name': '复旦大学上海医学院枫林路校区', 'location': '121.450745,31.196852', 'lng': 121.450745, 'lat': 31.196852},
{'id': 'B00156EFQL', 'name': '复旦大学江湾校区', 'location': '121.506221,31.336539', 'lng': 121.506221, 'lat': 31.336539},

{'id': 'B00155R1D5', 'name': '上海交通大学闵行校区', 'location': '121.436882,31.025626', 'lng': 121.436882, 'lat': 31.025626},
{'id': 'B00155L3CA', 'name': '上海交通大学徐汇校区', 'location': '121.433116,31.198981', 'lng': 121.433116, 'lat': 31.198981},
{'id': 'B00155QKZT', 'name': '上海交通大学七宝校区', 'location': '121.358862,31.147974', 'lng': 121.358862, 'lat': 31.147974},
{'id': 'B0015748HF', 'name': '上海交通大学长宁校区', 'location': '121.425418,31.206034', 'lng': 121.425418, 'lat': 31.206034},

{'id': 'B00155K8FL', 'name': '同济大学四平路校区', 'location': '121.501487,31.282942', 'lng': 121.501487, 'lat': 31.282942},
{'id': 'B00155QBTK', 'name': '同济大学沪西校区', 'location': '121.389991,31.271774', 'lng': 121.389991, 'lat': 31.271774},
{'id': 'B00155HU50', 'name': '同济大学嘉定校区', 'location': '121.21528,31.286143', 'lng': 121.21528, 'lat': 31.286143},
{'id': 'B00155BIO1', 'name': '同济大学沪北校区', 'location': '121.459001,31.261848', 'lng': 121.459001, 'lat': 31.261848},

{'id': 'B00155IVKB', 'name': '华东师范大学闵行校区', 'location': '121.45372,31.031449', 'lng': 121.45372, 'lat': 31.031449},
{'id': 'B00155IVZ7', 'name': '华东师范大学中山北路校区', 'location': '121.40468,31.227938', 'lng': 121.40468, 'lat': 31.227938},

{'id': 'B001577P9W', 'name': '华东理工大学徐汇校区法律系', 'location': '121.424700,31.142069', 'lng': 121.4247, 'lat': 31.142069},
{'id': 'B001557470', 'name': '华东理工大学金山校区', 'location': '121.318751,30.740168', 'lng': 121.318751, 'lat': 30.740168},
{'id': 'B0FFF3LXZR', 'name': '华东理工大学奉贤校区', 'location': '121.503709,30.83103', 'lng': 121.503709, 'lat': 30.83103},

{'id': 'B00155HB31', 'name': '上海大学嘉定校区', 'location': '121.249147,31.376636', 'lng': 121.249147, 'lat': 31.376636},
{'id': 'B00155IKLQ', 'name': '上海大学延长校区', 'location': '121.457689,31.275837', 'lng': 121.457689, 'lat': 31.275837},
{'id': 'B00155984M', 'name': '上海大学宝山校区', 'location': '121.393603,31.315929', 'lng': 121.393603, 'lat': 31.315929},

{'id': 'B0FFI9J410', 'name': '上海财经大学', 'location': '121.500810,31.306434', 'lng': 121.50081, 'lat': 31.306434},

{'id': 'B00155L2UD', 'name': '东华大学延安路校区', 'location': '121.41494,31.204408', 'lng': 121.41494, 'lat': 31.204408},
{'id': 'B00155CZ91', 'name': '东华大学松江校区', 'location': '121.213164,31.055582', 'lng': 121.213164, 'lat': 31.055582},

{'id': 'B00155IKSB', 'name': '上海理工大学军工路校区', 'location': '121.554866,31.292651', 'lng': 121.554866, 'lat': 31.292651},
{'id': 'B00155AIN3', 'name': '上海理工大学复兴路校区', 'location': '121.46043,31.211863', 'lng': 121.46043, 'lat': 31.211863},

{'id': 'B00155MMFN', 'name': '上海师范大学(徐汇校区)', 'location': '121.418411,31.161084', 'lng': 121.418411, 'lat': 31.161084},
{'id': 'B00154D79J', 'name': '上海师范大学(奉贤校区)', 'location': '121.516566,30.836661', 'lng': 121.516566, 'lat': 30.836661},

{'id': 'B00155L1UR', 'name': '上海中医药大学', 'location': '121.596333,31.193998', 'lng': 121.596333, 'lat': 31.193998},
{'id': 'B0FFL90V7G', 'name': '上海中医药大学惠南校区', 'location': '121.754964,31.052751', 'lng': 121.754964, 'lat': 31.052751},

{'id': 'B00155N9D9', 'name': '华东政法大学松江校区', 'location': '121.196087,31.05471', 'lng': 121.196087, 'lat': 31.05471},
{'id': 'B00155K7T2', 'name': '华东政法大学长宁校区', 'location': '121.417261,31.22636', 'lng': 121.417261, 'lat': 31.22636},

{'id': 'B00156TGF6', 'name': '上海海事大学东明路校区', 'location': '121.509735,31.173478', 'lng': 121.509735, 'lat': 31.173478},
{'id': 'B0FFF0JUD7', 'name': '上海海事大学临港校区', 'location': '121.905426,30.873795', 'lng': 121.905426, 'lat': 30.873795},
{'id': 'B00155MMWC', 'name': '上海海事大学港湾校区', 'location': '121.568916,31.263021', 'lng': 121.568916, 'lat': 31.263021},

{'id': 'B00155N15O', 'name': '上海海洋大学(军工路校区)', 'location': '121.556712,31.285925', 'lng': 121.556712, 'lat': 31.285925},
{'id': 'B00155K8GN', 'name': '上海海洋大学临港校区', 'location': '121.89691,30.882894', 'lng': 121.89691, 'lat': 30.882894},

{'id': 'B0FFF3YA07', 'name': '上海科技大学张江校区', 'location': '121.594493,31.177149', 'lng': 121.594493, 'lat': 31.177149},
{'id': 'B00157I2GO', 'name': '上海科技大学岳阳路校区', 'location': '121.453835,31.202365', 'lng': 121.453835, 'lat': 31.202365},

{'id': 'B0FFKBYRIA', 'name': '上海戏剧学院虹桥路校区', 'location': '121.393140,31.199349', 'lng': 121.39314, 'lat': 31.199349},
{'id': 'B0FFKDFMZX', 'name': '上海戏剧学院昌林路校区', 'location': '121.509511,31.064037', 'lng': 121.509511, 'lat': 31.064037},
{'id': 'B00155MZGA', 'name': '上海戏剧学院华山路校区', 'location': '121.440128,31.217211', 'lng': 121.440128, 'lat': 31.217211},
{'id': 'B00155K8I2', 'name': '上海戏剧学院莲花路校区', 'location': '121.399862,31.138033', 'lng': 121.399862, 'lat': 31.138033},

{'id': 'B00155IVXN', 'name': '上海体育学院', 'location': '121.525343,31.312332', 'lng': 121.525343, 'lat': 31.312332},
{'id': 'B00155HT7M', 'name': '上海体育学院徐汇校区', 'location': '121.431694,31.141732', 'lng': 121.431694, 'lat': 31.141732},

{'id': 'B00154DUXV', 'name': '上海外国语大学松江校区', 'location': '121.225685,31.047076', 'lng': 121.225685, 'lat': 31.047076},
{'id': 'B00154DUXW', 'name': '上海外国语大学虹口校区', 'location': '121.483354,31.277067', 'lng': 121.483354, 'lat': 31.277067},

{'id': 'B0FFFZJHTS', 'name': '上海音乐学院零陵校区', 'location': '121.452845,31.188986', 'lng': 121.452845, 'lat': 31.188986},
{'id': 'B00155N15X', 'name': '上海音乐学院汾阳校区', 'location': '121.454668,31.213711', 'lng': 121.454668, 'lat': 31.213711},

{'id': 'B0FFL7IES3', 'name': '上海公安学院通南路校区', 'location': '121.474966,31.339175', 'lng': 121.474966, 'lat': 31.339175},
{'id': 'B001556Y0P', 'name': '上海公安学院', 'location': '121.519285,31.380752', 'lng': 121.519285, 'lat': 31.380752},

{'id': 'B00155L3IZ', 'name': '上海对外经贸大学古北校区', 'location': '121.398843,31.207534', 'lng': 121.398843, 'lat': 31.207534},
{'id': 'B001559DEQ', 'name': '上海对外经贸大学七宝校区', 'location': '121.353101,31.157201', 'lng': 121.353101, 'lat': 31.157201},
{'id': 'B00155IVKT', 'name': '上海对外经贸大学松江校区', 'location': '121.217351,31.046372', 'lng': 121.217351, 'lat': 31.046372},

{'id': 'B00154DMJN', 'name': '上海工程技术大学长宁校区', 'location': '121.396823,31.204752', 'lng': 121.396823, 'lat': 31.204752},
{'id': 'B0FFMB8DSI', 'name': '上海工程技术大学松江校区-电子电气工程学院', 'location': '121.202890,31.058883', 'lng': 121.20289, 'lat': 31.058883},

{'id': 'B0FFI938JF', 'name': '上海电力学院(杨浦校区)', 'location': '121.547383,31.271498', 'lng': 121.547383, 'lat': 31.271498},
{'id': 'B0FFFWQI0N', 'name': '上海商学院国科路校区', 'location': '121.517066,31.285793', 'lng': 121.517066, 'lat': 31.285793},
{'id': 'B00154DUAF', 'name': '上海商学院徐汇校区', 'location': '121.429585,31.182593', 'lng': 121.429585, 'lat': 31.182593},

{'id': 'B00155R06J', 'name': '上海第二工业大学', 'location': '121.652772,31.260242', 'lng': 121.652772, 'lat': 31.260242},
{'id': 'B00155L3VU', 'name': '上海第二工业大学普陀分校', 'location': '121.433976,31.243975', 'lng': 121.433976, 'lat': 31.243975},
{'id': 'B001556TDC', 'name': '上海第二工业大学(宝山校区)', 'location': '121.491261,31.379115', 'lng': 121.491261, 'lat': 31.379115},
{'id': 'B0FFGSJ5XY', 'name': '上海第二工业大学静安分校', 'location': '121.4571,31.225352', 'lng': 121.4571, 'lat': 31.225352},
];
